app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'tamii@gmail.com'
 LIMIT 1
---
    public function index()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = $this->usersModel->where('email', $email)->first();