app/Controllers/Register.php

INSERT INTO `users` (`name`, `email`, `password`, `profile`) VALUES ('bayu', 'bayu@gmail.com', '$2y$10$YihObtM1lB.bZ3RPRhG2wuCuoyqbVpo2WWoVT4K652HhraobUMJjG', '1681355691_443dd1586e29534d3b84.png')
---
                'cost' => 10,
            ];

            $this->usersModel->save([
                'name' => $this->request->getVar('name'),
                'email' => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT, $options),
                'profile' => $profileName
            ]);